In [46]:
import pandas as pd
import numpy as np

#Dataframe
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
data

In [47]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [48]:
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [49]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [50]:
df.tail(2)

    Name   Age Department   Salary
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [51]:
#loc and iloc
df.iloc[1:3,1:2]

    Age
1  30.0
2  35.0

In [52]:
df.loc[1:2,["Age","Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance

In [53]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [54]:
df[["Age","Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [55]:
df.drop("Age",axis =1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [56]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [57]:
df.drop("Age", axis = 1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [58]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [59]:
df.shape

(6, 4)

In [60]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      str
 1   Age         5 non-null      float64
 2   Department  6 non-null      str
 3   Salary      5 non-null      float64
dtypes: float64(2), str(2)
memory usage: 324.0 bytes

In [61]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [62]:
# Broadcasting
df["Salary"] = df["Salary"]+5000
df["Salary"]
# df.dtypes

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [63]:
#Renaming column
df.rename(columns = {"Department" : "Dept"},inplace = True)
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

In [64]:
df["Dept"].unique()

<StringArray>
['HR', 'IT', 'Finance']
Length: 3, dtype: str

In [65]:
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [66]:
df["Promoted Salary"] = df["Salary"] * 10
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [67]:
#Data Cleaning
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [68]:
df.dropna(how = "all") #if all the values in any row are null

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [69]:
df.dropna(how = "any")

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
5    Alice  25.0       HR  55000.0         550000.0

In [70]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [71]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [72]:
df["Salary"].fillna(df["Salary"].median())

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4    65000.0
5    55000.0
Name: Salary, dtype: float64

In [73]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [74]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [75]:
# df["Age"] = df["Age"].fillna(method="bfill")
df["Age"] = df["Age"].bfill()
df["Age"]

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [76]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David  29.0       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [77]:
df["Name"] = df["Name"].replace("Charlie","Rose")
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David  29.0       IT  67000.0         670000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [78]:
df_dup = df[df.duplicated(keep="last")]
df_dup

    Name   Age Dept   Salary  Promoted Salary
0  Alice  25.0   HR  55000.0         550000.0

In [79]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David  29.0       IT  67000.0         670000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [80]:
#invalid salary
df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x:x/10 if x > 65000 else x)
df["Promoted Salary"]

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Promoted Salary, dtype: float64

In [81]:
#apply and lambda
def multipy_age(x):
    return x*2
df["Age"] = df["Age"].apply(multipy_age)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  50.0       HR  55000.0          55000.0
1    Bob  60.0       IT  65000.0          65000.0
2   Rose  70.0  Finance  75000.0          75000.0
3  David  58.0       IT  67000.0          67000.0
4    Eve  58.0       HR      NaN              NaN
5  Alice  50.0       HR  55000.0          55000.0

In [82]:
df["Age"] = df["Age"].apply(lambda x:x/2)

In [83]:
df["Age"]
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0          55000.0
1    Bob  30.0       IT  65000.0          65000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David  29.0       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0          55000.0

In [84]:
#Join and merge
import pandas as pd
department_info = {
    "Department": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}
df2 = pd.DataFrame(department_info)
df2

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

In [85]:
pd.concat([df,df2], axis =1)

,Name,Age,Dept,Salary,Promoted Salary,Department,Location,Manager
0,Alice,25.0,HR,55000.0,55000.0,HR,New York,Laura
1,Bob,30.0,IT,65000.0,65000.0,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,75000.0,Finance,Chicago,Nina
3,David,29.0,IT,67000.0,67000.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN
5,Alice,25.0,HR,55000.0,55000.0,NaN,NaN,NaN

In [86]:
# pd.merge(df,df2,on="Dept")
print(df.columns)
print(df2.columns)

Index(['Name', 'Age', 'Dept', 'Salary', 'Promoted Salary'], dtype='str')
Index(['Department', 'Location', 'Manager'], dtype='str')

In [87]:
pd.merge(df,df2, left_on="Dept",right_on="Department")

,Name,Age,Dept,Salary,Promoted Salary,Department,Location,Manager
0,Alice,25.0,HR,55000.0,55000.0,HR,New York,Laura
1,Bob,30.0,IT,65000.0,65000.0,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,75000.0,Finance,Chicago,Nina
3,David,29.0,IT,67000.0,67000.0,IT,San Francisco,Steve
4,Eve,29.0,HR,NaN,NaN,HR,New York,Laura
5,Alice,25.0,HR,55000.0,55000.0,HR,New York,Laura

In [88]:
df.columns = df.columns.str.strip()
df2.columns = df2.columns.str.strip()
pd.merge(df,df2, left_on="Dept",right_on= "Department")

,Name,Age,Dept,Salary,Promoted Salary,Department,Location,Manager
0,Alice,25.0,HR,55000.0,55000.0,HR,New York,Laura
1,Bob,30.0,IT,65000.0,65000.0,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,75000.0,Finance,Chicago,Nina
3,David,29.0,IT,67000.0,67000.0,IT,San Francisco,Steve
4,Eve,29.0,HR,NaN,NaN,HR,New York,Laura
5,Alice,25.0,HR,55000.0,55000.0,HR,New York,Laura

In [91]:
df["Dept"] = df["Dept"]
df.drop(columns= ["Department"], inplace = True)

KeyError: "['Department'] not found in axis"

In [92]:
df

    Name   Age     Dept   Salary  Promoted Salary     dept
0  Alice  25.0       HR  55000.0          55000.0       HR
1    Bob  30.0       IT  65000.0          65000.0       IT
2   Rose  35.0  Finance  75000.0          75000.0  Finance
3  David  29.0       IT  67000.0          67000.0       IT
4    Eve  29.0       HR      NaN              NaN       HR
5  Alice  25.0       HR  55000.0          55000.0       HR

In [93]:
df2

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

In [94]:
pd.concat([df,df2],axis = 1)

,Name,Age,Dept,Salary,Promoted Salary,dept,Department,Location,Manager
0,Alice,25.0,HR,55000.0,55000.0,HR,HR,New York,Laura
1,Bob,30.0,IT,65000.0,65000.0,IT,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,75000.0,Finance,Finance,Chicago,Nina
3,David,29.0,IT,67000.0,67000.0,IT,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,HR,NaN,NaN,NaN
5,Alice,25.0,HR,55000.0,55000.0,HR,NaN,NaN,NaN

In [97]:
df = df.drop(columns=["dept","Department"],errors="ignore")
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0          55000.0
1    Bob  30.0       IT  65000.0          65000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David  29.0       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0          55000.0

In [99]:
pd.concat([df,df2], axis =1)
df2

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

In [100]:
df2.rename(columns={"Department":"Dept"},inplace =True)

In [101]:
df2

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [102]:
pd.concat([df,df2],axis=1)

,Name,Age,Dept,Salary,Promoted Salary,Dept,Location,Manager
0,Alice,25.0,HR,55000.0,55000.0,HR,New York,Laura
1,Bob,30.0,IT,65000.0,65000.0,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,75000.0,Finance,Chicago,Nina
3,David,29.0,IT,67000.0,67000.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN
5,Alice,25.0,HR,55000.0,55000.0,NaN,NaN,NaN

In [103]:
pd.merge(df,df2, on = "Dept")

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  25.0       HR  55000.0          55000.0       New York   Laura
1    Bob  30.0       IT  65000.0          65000.0  San Francisco   Steve
2   Rose  35.0  Finance  75000.0          75000.0        Chicago    Nina
3  David  29.0       IT  67000.0          67000.0  San Francisco   Steve
4    Eve  29.0       HR      NaN              NaN       New York   Laura
5  Alice  25.0       HR  55000.0          55000.0       New York   Laura

In [108]:
data = pd.read_csv("fleet_management.csv")

In [109]:
data.head()

    hub  vehicle_id   model  battery     type  extra  rental_price     status
0  Pune         101      m3       90  Scooter    120          0.15  Available
1  Pune         102  cessec      100      Car      4          0.50  Available
2  Pune         101      m3       90  Scooter    120          0.15  Available
3  Pune         102  cessec      100      Car      4          0.50  Available
4  Pune         101      m3       90  Scooter    120          0.15  Available

In [110]:
data.shape

(38, 8)

In [112]:
data.info()

<class 'pandas.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   hub           38 non-null     str
 1   vehicle_id    38 non-null     int64
 2   model         38 non-null     str
 3   battery       38 non-null     int64
 4   type          38 non-null     str
 5   extra         38 non-null     int64
 6   rental_price  38 non-null     float64
 7   status        38 non-null     str
dtypes: float64(1), int64(3), str(4)
memory usage: 2.5 KB